[HIVETerror X2MissionTemplate]
DisplayName="Hive Swarm Siege"
Briefing="There is a higher number of civilans here than expected. This must have drawn in the Chryssalid Swarm. We have to save as many Civilians as we can."
PostMissionType="Hive Swarm Siege"
BriefingImage="img:///UILibrary_Common.Xcom_default"
MissionImage ="img:///UILIB_TheHiveMore.UI_MissionPrv_Swarm";
ObjectiveTextPools[0]="Some Resistance forces have managed to hold out but they will not last long. We need to save as many civilans as possible."
ObjectiveTextPools[1]="Save the Civilians before the Chryssalid Swarm consumes them."
PreMissionNarratives[0]="X2NarrativeMoments.TACTICAL.Unique.Central_Unique_Missions_Terror_Attack"
PreMissionNarratives[1]="X2NarrativeMoments.TACTICAL.Unique.T_Unique_Missions_Terror_Attack_Central_02"
PreMissionNarratives[2]="X2NarrativeMoments.TACTICAL.Unique.T_Unique_Missions_Terror_Attack_Central_03"
PreMissionNarratives[3]="X2NarrativeMoments.TACTICAL.Unique.T_Unique_Missions_Terror_Attack_Central_04"
PreMissionNarratives[4]="X2NarrativeMoments.TACTICAL.Unique.T_Unique_Missions_Terror_Attack_Central_05"
PreMissionNarratives[5]="X2NarrativeMoments.TACTICAL.Terror.T_Terror_Narrative_Wrappers_01"
PreMissionNarratives[6]="X2NarrativeMoments.TACTICAL.Terror.T_Terror_Narrative_Wrappers_02"
PreMissionNarratives[7]="X2NarrativeMoments.TACTICAL.Terror.T_Terror_Narrative_Wrappers_03"
PreMissionNarratives[8]="X2NarrativeMoments.TACTICAL.Terror.T_Terror_Narrative_Wrappers_04"
PreMissionNarratives[9]="X2NarrativeMoments.TACTICAL.Terror.T_Terror_Narrative_Wrappers_05"

[HIVETerror X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Save at least 6 Civilians from the Chryssalid Swarm"
ObjectiveTextPools[1]="Eliminate the Chryssalid Advance"
ObjectiveTextPools[2]="Extract all XCOM soldiers"


[HIVEFishingTerror X2MissionTemplate]
DisplayName="Investigate Fishing Town Disturbance"
Briefing="Resitance reports claim creatures came from the sea. We lost contact with the town and need to investigate."
PostMissionType="Investigate Fishing Town Disturbance"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Eliminate the Chryssalid threat"

[HIVEFishingTerror X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Eliminate the Chryssalid threat"

[HIVESupplyExtractionTerror X2MissionTemplate]
DisplayName="Secure supplies and rescue Civilains from the Chryssalid threat"
Briefing="A small Resistance unit escorting civilians has found an abandoned ADVENT Supply cashe. Get in, help the Resistance and get those supplies before ADVENT."
PostMissionType="Secure supplies and rescue Civilains from the Chryssalid threat"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Secure and extract Resistance supplies"
ObjectiveTextPools[1]="Neutralize all enemy targets"
PreMissionNarratives[0]="XPACK_NarrativeMoments.X2_XP_CEN_T_Extract_Supplies_Dropship_Intro_A"
PreMissionNarratives[1]="XPACK_NarrativeMoments.X2_XP_CEN_T_Extract_Supplies_Dropship_Intro_B"
PreMissionNarratives[2]="XPACK_NarrativeMoments.X2_XP_CEN_T_Extract_Supplies_Dropship_Intro_C"

[HIVESupplyExtractionTerror X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Mark and recover Resistance crates"
ObjectiveTextPools[1]="Neutralize all enemy targets"
ObjectiveTextPools[2]="Extract all XCOM soldiers"
ObjectiveTextPools[3]="OR: Eliminate all remaining hostile targets"


[HIVECovertEscape X2MissionTemplate]
DisplayName="Escape Chryssalid hunters"
Briefing="Covert Action - Escape Chryssalid hunters"
PostMissionType="Escape Chryssalid hunters"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Escape the combat zone"

[HIVECovertEscape X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Reach the rendezvous"
ObjectiveTextPools[1]="Avoid Chryssalids And Extract"

[HIVEChosenAvengerDefense X2MissionTemplate]
DisplayName="Repel the Hive Avenger Assault"
Briefing="Defend the Avenger from the Chosen and the Chryssalid Swarm"
PostMissionType="Hive Avenger Assault"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Protect the Avenger from the Chryssalid threat"
ObjectiveTextPools[1]="Locate and Destroy the Disruptor"

[HIVEChosenAvengerDefense X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Destroy all turrets targeting the Avenger"
ObjectiveTextPools[1]="Destroy the Mobile Power Generator"
ObjectiveTextPools[2]="Eliminate the Chryssalid threat"


[HiveAvengerDefense X2MissionTemplate]
DisplayName="Defend the Avenger from the Chryssalid Swarm"
Briefing="Defend the Avenger from the Chryssalid Swarm"
PostMissionType="Defend the Avenger from the Chryssalid Swarm"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Protect the Avenger from the Chryssalid Swarm"
ObjectiveTextPools[1]="Locate and Destroy the Disruptor"

[HIVEAvengerDefense X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Return all XCOM soldiers to Avenger's ramp"
ObjectiveTextPools[1]="Issue take off command"
ObjectiveTextPools[2]="Destroy the Disruptor"
ObjectiveTextPools[3]="Enemies must not reach Avenger's ramp"


[HiveGatherSurvivors X2MissionTemplate]
DisplayName="Gather Survivors from the Abandoned Hive Infested City"
Briefing="Gather Survivors from the Abandoned Hive Infested City. Get the Survivers and get out!"
PostMissionType="Gather Survivors from the Abandoned Hive Infested City"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Gather Resistance survivors"
ObjectiveTextPools[1]="Deliver survivors to extraction point"
PreMissionNarratives[0]="XPACK_NarrativeMoments.X2_XP_CEN_T_Gather_Survivors_Dropship_Intro_A"
PreMissionNarratives[1]="XPACK_NarrativeMoments.X2_XP_CEN_T_Gather_Survivors_Dropship_Intro_B"
PreMissionNarratives[2]="XPACK_NarrativeMoments.X2_XP_CEN_T_Gather_Survivors_Dropship_Intro_C"

[HiveGatherSurvivors X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Rescue the Resistance Contact"
ObjectiveTextPools[1]="Rescue the Resistance VIP"
ObjectiveTextPools[2]="Optional: Rescue any additional Resistance operatives"
ObjectiveTextPools[3]="Extract the VIP at the designated EVAC"
ObjectiveTextPools[4]="Extract all XCOM operatives"

[HIVERipperSwarm X2MissionTemplate]
DisplayName="Investigate reports of a large Chryssalid Swarm"
Briefing="Resitance reports claim a large Chryssalid infestation in the area. We should investigate."
PostMissionType="Investigate Chryssalid Swarm reports"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Eliminate the Chryssalid Ripper Swarm"

[HIVERipperSwarm X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Eliminate the Chryssalid Ripper Swarm"


[HIVENewfoundland X2MissionTemplate]
DisplayName="Destroy the transmitter attracting Chryssalids"
Briefing="Destroy the transmitter attracting Chryssalids to the fishing town and find out why we lost contact."
PostMissionType="Destroy the transmitter attracting Chryssalids"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Eliminate the Chryssalid threat"
ObjectiveTextPools[1]="Destroy Transmitter"

[HIVENewfoundland X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Eliminate the Chryssalid threat"
ObjectiveTextPools[1]="Destroy Transmitter"




;*****HIVE MORE CHRYSSALID RIPPER*****

[CXRipperExploder X2CharacterTemplate]
strCharacterName="Chryssalid Needle Ripper"

[RipperNeedleExplosion X2AbilityTemplate]
LocFriendlyName="Needle Explosion"
LocLongDescription="This Ripper is highly volatile and will explode."
LocHelpText="This Ripper is highly volatile and will explode."




